.next/server/pages/api/swifin/update-profile.js

"use strict";(()=>{var a={};a.id=247,a.ids=[247],a.modules={1131:(a,e,i)=>{i.r(e),i.d(e,{config:()=>p,default:()=>u,routeModule:()=>c});var n={};i.r(n),i.d(n,{default:()=>s});var d=i(3480),m=i(8667),r=i(6435),t=i(7062);let o=require("cookies-next"),l=[{id:4,name:"Afghanistan"},{id:5,name:"Albania"},{id:6,name:"Algeria"},{id:7,name:"Andorra"},{id:8,name:"Angola"},{id:9,name:"Antigua and Barbuda"},{id:10,name:"Argentina"},{id:11,name:"Armenia"},{id:12,name:"Australia"},{id:13,name:"Austria"},{id:14,name:"Azerbaijan"},{id:15,name:"Bahamas"},{id:16,name:"Bahrain"},{id:17,name:"Bangladesh"},{id:18,name:"Barbados"},{id:19,name:"Belarus"},{id:20,name:"Belgium"},{id:21,name:"Belize"},{id:22,name:"Benin"},{id:23,name:"Bhutan"},{id:24,name:"Bolivia"},{id:25,name:"Bosnia and Herzegovina"},{id:26,name:"Botswana"},{id:27,name:"Brazil"},{id:28,name:"Brunei"},{id:29,name:"Bulgaria"},{id:30,name:"Burkina Faso"},{id:31,name:"Burundi"},{id:32,name:"Cabo Verde"},{id:33,name:"Cambodia"},{id:34,name:"Cameroon"},{id:35,name:"Canada"},{id:36,name:"Central African Republic"},{id:37,name:"Chad"},{id:38,name:"Chile"},{id:39,name:"China"},{id:40,name:"Colombia"},{id:41,name:"Comoros"},{id:42,name:"Congo Democratic Republic"},{id:43,name:"Congo Republic"},{id:44,name:"Costa Rica"},{id:45,name:"Cote d'Ivoire"},{id:46,name:"Croatia"},{id:47,name:"Cuba"},{id:48,name:"Cyprus"},{id:49,name:"Czechia"},{id:50,name:"Denmark"},{id:51,name:"Djibouti"},{id:52,name:"Dominica"},{id:53,name:"Dominican Republic"},{id:54,name:"Ecuador"},{id:55,name:"Egypt"},{id:56,name:"El Salvador"},{id:57,name:"Equatorial Guinea"},{id:58,name:"Eritrea"},{id:59,name:"Estonia"},{id:60,name:"Eswatini"},{id:61,name:"Ethiopia"},{id:62,name:"Fiji"},{id:63,name:"Finland"},{id:64,name:"France"},{id:65,name:"Gabon"},{id:66,name:"Gambia"},{id:67,name:"Georgia"},{id:68,name:"Germany"},{id:69,name:"Ghana"},{id:70,name:"Greece"},{id:71,name:"Grenada"},{id:72,name:"Guatemala"},{id:73,name:"Guinea"},{id:74,name:"Guinea-Bissau"},{id:75,name:"Guyana"},{id:76,name:"Haiti"},{id:77,name:"Honduras"},{id:78,name:"Hungary"},{id:79,name:"Iceland"},{id:80,name:"India"},{id:81,name:"Indonesia"},{id:82,name:"Iran"},{id:83,name:"Iraq"},{id:84,name:"Ireland"},{id:85,name:"Israel"},{id:86,name:"Italy"},{id:87,name:"Jamaica"},{id:88,name:"Japan"},{id:89,name:"Jordan"},{id:90,name:"Kazakhstan"},{id:91,name:"Kenya"},{id:92,name:"Kiribati"},{id:93,name:"Kosovo"},{id:94,name:"Kuwait"},{id:95,name:"Kyrgyzstan"},{id:96,name:"Laos"},{id:97,name:"Latvia"},{id:98,name:"Lebanon"},{id:99,name:"Lesotho"},{id:100,name:"Liberia"},{id:101,name:"Libya"},{id:102,name:"Liechtenstein"},{id:103,name:"Lithuania"},{id:104,name:"Luxembourg"},{id:105,name:"Madagascar"},{id:106,name:"Malawi"},{id:107,name:"Malaysia"},{id:108,name:"Maldives"},{id:109,name:"Mali"},{id:110,name:"Malta"},{id:111,name:"Marshall Islands"},{id:112,name:"Mauritania"},{id:113,name:"Mauritius"},{id:114,name:"Mexico"},{id:115,name:"Micronesia"},{id:116,name:"Moldova"},{id:117,name:"Monaco"},{id:118,name:"Mongolia"},{id:119,name:"Montenegro"},{id:120,name:"Morocco"},{id:121,name:"Mozambique"},{id:122,name:"Myanmar"},{id:123,name:"Namibia"},{id:124,name:"Nauru"},{id:125,name:"Nepal"},{id:126,name:"Netherlands"},{id:127,name:"New Zealand"},{id:128,name:"Nicaragua"},{id:129,name:"Niger"},{id:130,name:"Nigeria"},{id:131,name:"North Korea"},{id:132,name:"North Macedonia"},{id:133,name:"Norway"},{id:134,name:"Oman"},{id:135,name:"Pakistan"},{id:136,name:"Palau"},{id:137,name:"Palestine"},{id:138,name:"Panama"},{id:139,name:"Papua New Guinea"},{id:140,name:"Paraguay"},{id:141,name:"Peru"},{id:142,name:"Philippines"},{id:143,name:"Poland"},{id:144,name:"Portugal"},{id:145,name:"Qatar"},{id:146,name:"Romania"},{id:147,name:"Russia"},{id:148,name:"Rwanda"},{id:149,name:"Saint Kitts and Nevis"},{id:150,name:"Saint Lucia"},{id:151,name:"Saint Vincent and the Grenadines"},{id:152,name:"Samoa"},{id:153,name:"San Marino"},{id:154,name:"Sao Tome and Principe"},{id:155,name:"Saudi Arabia"},{id:156,name:"Senegal"},{id:157,name:"Serbia"},{id:158,name:"Seychelles"},{id:159,name:"Sierra Leone"},{id:160,name:"Singapore"},{id:161,name:"Slovakia"},{id:162,name:"Slovenia"},{id:163,name:"Solomon Islands"},{id:164,name:"Somalia"},{id:165,name:"South Africa"},{id:166,name:"South Korea"},{id:167,name:"South Sudan"},{id:168,name:"Spain"},{id:169,name:"Sri Lanka"},{id:170,name:"Sudan"},{id:171,name:"Suriname"},{id:172,name:"Sweden"},{id:173,name:"Switzerland"},{id:174,name:"Syria"},{id:175,name:"Taiwan"},{id:176,name:"Tajikistan"},{id:177,name:"Tanzania"},{id:178,name:"Thailand"},{id:179,name:"Timor-Leste"},{id:180,name:"Togo"},{id:181,name:"Tonga"},{id:182,name:"Trinidad and Tobago"},{id:183,name:"Tunisia"},{id:184,name:"Turkey"},{id:185,name:"Turkmenistan"},{id:186,name:"Tuvalu"},{id:187,name:"Uganda"},{id:188,name:"Ukraine"},{id:189,name:"United Arab Emirates"},{id:190,name:"United Kingdom"},{id:191,name:"United States of America"},{id:192,name:"Uruguay"},{id:193,name:"Uzbekistan"},{id:194,name:"Vanuatu"},{id:195,name:"Vatican City"},{id:196,name:"Venezuela"},{id:197,name:"Vietnam"},{id:198,name:"Yemen"},{id:199,name:"Zambia"},{id:200,name:"Zimbabwe"}];async function s(a,e){if("POST"!==a.method)return e.status(405).json({error:"Method Not Allowed"});let i=(0,o.getCookies)({req:a,res:e});(0,t.Y)(i.swifinId),(0,t.Y)(i.swifinPassword);let{id:n,principal:d,name:m,email:r,birthday:s,gender:u,mobilePhone:p,address:c,postalCode:f,city:y,country:v}=a.body,b=Buffer.from(`${process.env.ADMIN_SWIFIN_ID}:${process.env.ADMIN_SWIFIN_PASSWORD}`).toString("base64"),S=l.find(a=>a.name===v),h=S?S.id:190,N=`
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mem="http://members.webservices.cyclos.strohalm.nl/">
   <soapenv:Header/>
   <soapenv:Body>
      <mem:updateMember>
         <params>
            <id>${n}</id>
            <principalType>username</principalType>
            <principal>${d}</principal>
            <name>${m}</name>
            <email>${r}</email>
            <fields>
              <internalName>birthday</internalName>
              <fieldId>1</fieldId>
              <displayName>Birthday</displayName>
              <value>${s}</value>
            </fields>
            <fields>
              <internalName>gender</internalName>
              <fieldId>2</fieldId>
              <displayName>Gender</displayName>
              <value>${u}</value>
            </fields>
            <fields>
              <internalName>mobilePhone</internalName>
              <fieldId>8</fieldId>
              <displayName>Mobile Phone</displayName>
              <value>${p}</value>
            </fields>
            <fields>
              <internalName>address</internalName>
              <fieldId>3</fieldId>
              <displayName>Address</displayName>
              <value>${c}</value>
            </fields>
            <fields>
              <internalName>postalCode</internalName>
              <fieldId>4</fieldId>
              <displayName>Postal Code</displayName>
              <value>${f}</value>
            </fields>
            <fields>
              <internalName>city</internalName>
              <fieldId>5</fieldId>
              <displayName>City</displayName>
              <value>${y}</value>
            </fields>
            <fields>
              <internalName>country</internalName>
              <fieldId>13</fieldId>
              <displayName>Country</displayName>
              <value>${h}</value>
            </fields>
         </params>
      </mem:updateMember>
   </soapenv:Body>
</soapenv:Envelope>`;try{let a=await fetch("http://webservice.swifin.com/services/members",{method:"POST",headers:{Authorization:`Basic ${b}`,"Content-Type":"text/xml;charset=UTF-8",SOAPAction:""},body:N}),i=await a.text();if(i.includes("<ns2:updateMemberResponse"))return e.status(200).json({success:!0});return e.status(500).json({error:"Failed to update member profile",raw:i})}catch(a){return console.error("[update-profile] Error:",a),e.status(500).json({error:"Server Error",details:a.message})}}let u=(0,r.M)(n,"default"),p=(0,r.M)(n,"config"),c=new d.PagesAPIRouteModule({definition:{kind:m.A.PAGES_API,page:"/api/swifin/update-profile",pathname:"/api/swifin/update-profile",bundlePath:"",filename:""},userland:n})},3480:(a,e,i)=>{a.exports=i(5600)},5600:a=>{a.exports=require("next/dist/compiled/next-server/pages-api.runtime.prod.js")},6435:(a,e)=>{Object.defineProperty(e,"M",{enumerable:!0,get:function(){return function a(e,i){return i in e?e[i]:"then"in e&&"function"==typeof e.then?e.then(e=>a(e,i)):"function"==typeof e&&"default"===i?e:void 0}}})},7062:(a,e,i)=>{i.d(e,{Y:()=>t,w:()=>r});let n=require("crypto-js");var d=i.n(n);let m=process.env.SWIFIN_SECRET_KEY;function r(a){return d().AES.encrypt(a,m).toString()}function t(a){return d().AES.decrypt(a,m).toString(d().enc.Utf8)}},8667:(a,e)=>{Object.defineProperty(e,"A",{enumerable:!0,get:function(){return i}});var i=function(a){return a.PAGES="PAGES",a.PAGES_API="PAGES_API",a.APP_PAGE="APP_PAGE",a.APP_ROUTE="APP_ROUTE",a.IMAGE="IMAGE",a}({})}};var e=require("../../../webpack-api-runtime.js");e.C(a);var i=e(e.s=1131);module.exports=i})();